In [1]:
import pandas as pd

In [2]:
import sqlalchemy

In [3]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:@localhost:3306/application')

In [4]:
df = pd.read_sql_table('customers', engine)

In [5]:
df

   id    name phone_number
0   1  Donald   7326784567
1   2    Bill   6573489999
2   3    Modi   4567895646

In [6]:
df = pd.read_sql_table('customers', engine, columns=['name'])

In [7]:
df

     name
0  Donald
1    Bill
2    Modi

In [8]:
query = '''select id, name from customers'''

In [9]:
df = pd.read_sql_query(query, engine)
df

   id    name
0   1  Donald
1   2    Bill
2   3    Modi

In [10]:
query = '''
 SELECT customers.name, customers.phone_number, orders.name, orders.amount
 FROM customers INNER JOIN orders
 ON customers.id=orders.customer_id
'''

In [11]:
query = '''
 SELECT customers.name, customers.phone_number, orders.name, orders.amount
 FROM customers INNER JOIN orders
 ON customers.id=orders.customer_id
'''

In [12]:
pd.read_sql('customers',engine)

   id    name phone_number
0   1  Donald   7326784567
1   2    Bill   6573489999
2   3    Modi   4567895646

In [13]:
df = pd.read_csv('customers.csv')
df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [14]:
df.rename(columns={
    'Customer Name': 'name',
    'Customer Phone': 'phone_number'
}, inplace=True)

In [15]:
df

              name  phone_number
0     rafael nadal    4567895647
1  maria sharapova     434534545
2   vladimir putin      89345345
3      kim un jong     123434456
4       jeff bezos     934534543
5     rahul gandhi      44324222

In [16]:
df.to_sql(
    name='customers',
    con=engine,
    if_exists='append',
    index=False
)